#include "common.h"

typedef s32 ALMicroTime;

typedef struct {
} ALPlayer;

typedef struct {
} ALGlobals;

typedef struct {
} ALWaveTable;

typedef struct {
} ALRawLoop;

typedef struct {
} ALVoice;


#define AL_RAW16_WAVE 1

// raw, signed 8-bit PCM audio data
#define H2O_RAW8_WAVE 2

typedef struct {
  /* 0x0 */ s32   dcm1;  // 'DCM1' as int
  /* 0x4 */ u8    num_channels;
  /* 0x5 */ u8    num_samples;
  /* 0x8 */ s32   stream_sz;
  /* 0xC */ s32   unkC;  // 0
} DcmHeader; // 0x10 bytes

typedef struct {
  /* 0x0 */ u32   smplen;
  /* 0x4 */ u32   loopBegin;
  /* 0x8 */ u32   loopEnd;
  /* 0xC */ u16   flags;
  /* 0xE */ u16   id;
} Sample; // 0x10 bytes

typedef struct {
  /* 0x0   */ ALWaveTable   wt[66];
  /* 0x528 */ u8           *wt_base[66];
  /* 0x630 */ s32           wt_len[66];
  /* 0x738 */ u32           loopBegin[66];
  /* 0x840 */ u32           loopEnd[66];
  /* 0x948 */ ALRawLoop     rawLoop[66];
} UnkStruct_96; // 0xC60 bytes

typedef struct {
  /* 0x0  */ ALVoice       v;
  /* 0x1C */ ALWaveTable  *wt;
  /* 0x20 */ f32           pitch;
  /* 0x24 */ s16           vol;
  /* 0x26 */ s8            pan;
  /* 0x27 */ u8            state;
  /* 0x28 */ s16           unk28;  // vol index
} Channel; // 0x2C bytes

typedef struct {
  /* 0x0    */ ALPlayer       node;
  /* 0x14   */ ALGlobals     *alGlobals;
  /* 0x18   */ Sample         unk18[64];
  /* 0x418  */ DcmHeader      unk418;
  /* 0x428  */ u8             unk428[16];
  /* 0x438  */ UnkStruct_96  *unk438;
  /* 0x43C  */ Channel       *channels;
  /* 0x440  */ s32            unk440;  // number of channels
  /* 0x444  */ u8            *unk444;  // stream
  /* 0x448  */ u8            *unk448;
  /* 0x44C  */ u8            *unk44C;  // stream
  /* 0x450  */ u32            unk450;
  /* 0x454  */ u8             unk454;
  /* 0x458  */ UnkStruct_85   unk458;
  /* 0x1468 */ u8             unk1468[256];
  /* 0x1568 */ u16            unk1568;
  /* 0x156A */ u16            unk156A;
  /* 0x156C */ u32            unk156C;
  /* 0x1570 */ u8             unk1570;  // boolean
  /* 0x1571 */ u8             unk1571;
  /* 0x1572 */ u8             unk1572;
  /* 0x1574 */ u8            *unk1574;
  /* 0x1578 */ s32            unk1578;
  /* 0x157C */ s16            unk157C;  // music_level (volume)
  /* 0x157E */ s16            unk157E;
  /* 0x1580 */ u16            unk1580;  // song num
  /* 0x1582 */ u16            unk1582;  // song num
  /* 0x1584 */ u8             unk1584;  // boolean
  /* 0x1585 */ u8             unk1585;
  /* 0x1586 */ u8             unk1586;
  /* 0x1587 */ u8             unk1587;  // boolean
  /* 0x1588 */ s16            unk1588;
  /* 0x158A */ s16            unk158A;
  /* 0x158C */ u8             unk158C;  // boolean
  /* 0x158D */ s8             unk158D;  // pan_level
  /* 0x158E */ u8             unk158E;  // boolean
  /* 0x1590 */ u8            *unk1590;
  /* 0x1594 */ u8             pad1594[0x4];
  /* 0x1598 */ u8             unk1598;
  /* 0x1599 */ u8             unk1599;  // boolean
  /* 0x159A */ u8             pad159A[0x6];
} SongPlayer; // 0x15A0 bytes

SongPlayer g_songPlayer;
UnkStruct_96 D_80123A18;
Channel D_80124678[16];
void *D_80126790;
u16 D_80128DD8;

static s32 D_800D3B3C = 0;
static s32 D_800D3B40[4] = { 0, 0x4000, 0xC000, 0x1C000 };

static void Audio2_800874ac_sevenliner(SongPlayer *);
static void Audio2_8008756c_eightliner(SongPlayer *);
static ALMicroTime Dcm_VoiceHandler(void *);
static f32 Dcm_SetPitch(u16);
static void Audio2_8008bf58_eightliner(u8 *, DcmHeader *);
static void Audio2_8008c014_tenliner(u8 *, Sample *);
static s16 Audio2_8008c0e0_oneliner_arg0_math(u8 *);
static s32 Audio2_8008c104_oneliner_arg0_math_2(u8 *);
static s32 Audio2_8008c130_oneliner_arg0_math_3(u8 *);


#define NROWS 64

typedef struct {
  /* 0x0 */ u8   flags;
  /* 0x1 */ u8   note;
  /* 0x2 */ u8   instrument;
  /* 0x3 */ u8   volume;
  /* 0x4 */ u8   effect;
  /* 0x5 */ u8   effect_param;
} XmPacket; // 0x6 bytes

typedef struct XmPattern XmPattern;
struct XmPattern {
  /* 0x0  */ XmPattern  *next;
  /* 0x4  */ u32         hdrlen;        // Pattern header length
  /* 0x8  */ u8          packing_type;  // Packing type
  /* 0xA  */ u16         nrows;         // Number of rows in pattern
  /* 0xC  */ u16         data_sz;       // Packed pattern data size
  /* 0x10 */ XmPacket   *data;          // Packed pattern data
}; // 0x14 bytes

typedef struct {
  /* 0x0  */ u8    sample_num;
  /* 0x4  */ u32   sample_rate;
  /* 0x8  */ u32   freq;
  /* 0xC  */ u8    vol;
  /* 0xD  */ u8    volume;
  /* 0xE  */ u8    pan;
} ChannelNote; // 0x10 bytes

static ChannelNote channel_note[16];
static u16 song_no = 0;
static u16 bpm = 0;
static XmPattern *xm_patterns = NULL;

void fwrite_le2(u16 s, FILE *fp) {
  char buf[2];

  buf[0] = s & 0xFF;
  buf[1] = (s >> 8) & 0xFF;
  fwrite(buf, 1, 2, fp);
}

void fwrite_le4(u32 i, FILE *fp) {
  char buf[4];

  buf[0] = i & 0xFF;
  buf[1] = (i >> 8) & 0xFF;
  buf[2] = (i >> 16) & 0xFF;
  buf[3] = (i >> 24) & 0xFF;
  fwrite(buf, 1, 4, fp);
}

XmPattern *new_xm_pattern(u8 nrows, u8 nchannels) {
  XmPattern *xm_pattern;

  xm_pattern = malloc(sizeof(XmPattern));
  xm_pattern->next = NULL;
  xm_pattern->hdrlen = 9;
  xm_pattern->packing_type = 0;
  xm_pattern->nrows = nrows;
  xm_pattern->data_sz = 0;
  xm_pattern->data = malloc(sizeof(XmPacket) * nrows * nchannels);

  return xm_pattern;
}

void push_xm_pattern(XmPattern **headRef, XmPattern *xm_pattern) {
  xm_pattern->next = *headRef;
  *headRef = xm_pattern;
}

void free_xm_patterns(XmPattern **headRef) {
  XmPattern *current;

  while (*headRef != NULL) {
    current = *headRef;
    *headRef = current->next;
    free(current->data);
    free(current);
  }
}

u16 reverse_xm_patterns(XmPattern **headRef) {
  XmPattern *reverse = NULL;
  XmPattern *current;
  u16 npatterns = 0;

  while (*headRef != NULL) {
    current = *headRef;
    *headRef = current->next;
    current->next = reverse;
    reverse = current;
    npatterns++;
  }

  *headRef = reverse;
  return npatterns;
}

u16 dedupe_xm_patterns(XmPattern *head, u8 nchannels, char *pattern_order) {
  XmPattern *current = head;
  u16 npatterns = 0;
  u16 ndupes = 0;

  int i = 0;
  while (current != NULL) {
    int j = i;
    while (pattern_order[j] != i) {
      j++;
    }
    j++;

    XmPattern *next = current->next;
    XmPattern *prev = current;
    while (next != NULL) {
      while (pattern_order[j] != i) {
        j++;
      }

      XmPacket *pkt_current = current->data;
      XmPacket *pkt_next = next->data;
      int same = TRUE;
      for (int k = 0; k < current->nrows * nchannels; k++) {
        if (pkt_current->flags != pkt_next->flags) { same = FALSE; break; }
        if ((pkt_current->flags & 0x1) && (pkt_current->note != pkt_next->note)) { same = FALSE; break; }
        if ((pkt_current->flags & 0x2) && (pkt_current->instrument != pkt_next->instrument)) { same = FALSE; break; }
        if ((pkt_current->flags & 0x4) && (pkt_current->volume != pkt_next->volume)) { same = FALSE; break; }
        if ((pkt_current->flags & 0x8) && (pkt_current->effect != pkt_next->effect)) { same = FALSE; break; }
        if ((pkt_current->flags & 0x10) && (pkt_current->effect_param != pkt_next->effect_param)) { same = FALSE; break; }
        pkt_current++;
        pkt_next++;
      }
      if (same) {
        prev->next = next->next;
        free(next->data);
        free(next);
        next = prev;
        ndupes++;
      } else {
        pattern_order[j] = i+1;
      }

      prev = next;
      next = next->next;
      j++;
    }

    current = current->next;
    i++;
    npatterns++;
  }

  return ndupes;
}

void fwrite_xm_patterns(XmPattern *head, FILE *fp, u8 nchannels) {
  XmPattern *current = head;

  while (current != NULL) {
    fwrite_le4(current->hdrlen, fp);   // Pattern header length
    fputc(current->packing_type, fp);  // Packing type
    fwrite_le2(current->nrows, fp);    // Number of rows in pattern
    fwrite_le2(current->data_sz, fp);  // Packed pattern data size

    XmPacket *pkt = current->data;
    for (int i = 0; i < current->nrows * nchannels; i++) {
      fputc(pkt->flags, fp);
      if (pkt->flags & 0x1) fputc(pkt->note, fp);
      if (pkt->flags & 0x2) fputc(pkt->instrument, fp);
      if (pkt->flags & 0x4) fputc(pkt->volume, fp);
      if (pkt->flags & 0x8) fputc(pkt->effect, fp);
      if (pkt->flags & 0x10) fputc(pkt->effect_param, fp);
      pkt++;
    }

    current = current->next;
  }
}

void print_DcmHeader(DcmHeader *dcmHeader) {
  printf("dcm1: %c%c%c%c\n", dcmHeader->dcm1 >> 24, dcmHeader->dcm1 >> 16, dcmHeader->dcm1 >> 8, dcmHeader->dcm1);
  printf("num_channels: %d\n", dcmHeader->num_channels);
  printf("num_samples: %d\n", dcmHeader->num_samples);
  printf("stream_sz: %d 0x%X\n", dcmHeader->stream_sz, dcmHeader->stream_sz);
}

void print_Sample(Sample *sample) {
  printf("smplen: %d\n", sample->smplen);
  printf("loopBegin: %d\n", sample->loopBegin);
  printf("loopEnd: %d\n", sample->loopEnd);
  printf("flags: %04b\n", sample->flags);
  printf("id: %d\n", sample->id);
}

u32 title_sample_rates[] = { 13100, 7600, 11025, 7600, 8363, 13100, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 36000, 22050, 22050, 22050, 22050 };
u32 morocco_sample_rates[] = { 6600, 26200, 8363, 8363, 11025, 11025, 11025, 11025, 11025, 8363, 20000, 8363, 26300, 8363, 26300, 26300, 8363, 11025 };
u32 dvie_sample_rates[] = { 13100, 8363, 8363, 12000, 13050, 23400, 23400, 8363, 8363, 39000, 8363, 8363, 8363, 8363, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050 };
u32 polyasia_sample_rates[] = { 22050, 8363, 8363, 8363, 8363, 32500, 8363, 8363, 24600, 24600, 10000, 8363, 8363, 8363, 8363, 44100, 8363, 8363, 8363, 8363 };
u32 floppy_sample_rates[] = { 8363, 8363, 8363, 8363, 8363, 14400, 8363, 21970, 21970, 8363, 8363, 8363, 28800, 8363, 20700, 28800, 28800, 8363, 8363, 34600, 34600, 8363, 34600, 38000 };
u32 pyramid_sample_rates[] = { 8363, 8363, 8363, 8363, 8363, 8363, 12900, 8363, 8363, 8363, 8400, 8363, 26200, 31300, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 22050, 22050, 22050, 22050, 22050, 44100, 22050, 22050, 22050, 22050 };
u32 giali_sample_rates[] = { 8363, 10000, 11025, 26200, 44020, 8363, 8363, 8363, 12900, 8363, 8363, 8363, 8363, 8363, 8363, 43950, 24600, 24600, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363 };
u32 thread6_sample_rates[] = { 16050, 8363, 7000, 8363, 8363, 8363, 8363, 8363, 27600, 27600, 11025, 11025, 11025, 11025, 11025, 11025, 11025, 11025, 11025, 11025, 11025, 11025, 11025, 11025, 11025, 13400, 8800, 22050, 35900, 43200, 8363, 8363 };
u32 haluci_sample_rates[] = { 13100, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 26300, 26300, 26300, 26100, 8363, 8363, 8363, 5500, 11025, 11025, 11025, 8363, 11025, 8363, 8363 };
u32 mayan_sample_rates[] = { 13100, 8363, 26200, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 36000, 25800, 11025, 11025, 11025, 11025, 11025, 8363, 11025, 19700, 8363, 19700, 19700, 8363, 11025 };
u32 greek_sample_rates[] = { 7500, 7500, 8363, 7500, 7500, 43000, 41170, 26200, 8363, 8363, 26200, 8363, 11025, 11025, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 5500, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363 };
u32 egypt_sample_rates[] = { 8363, 24600, 8363, 8363, 24600, 8363, 8363, 8363, 8363, 10000, 8363, 8363, 26200, 8363, 8363, 8363, 22050, 22050, 22050, 22050, 21970, 22050, 22050 };
u32 celtic_sample_rates[] = { 7000, 8363, 8363, 8363, 18110, 8363, 8363, 8363, 26200, 8363, 21700, 24600, 24600, 14600, 14600, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050, 22050 };
u32 africa_sample_rates[] = { 11025, 22050, 22050, 22050, 22050, 21600, 21600, 21600, 21970, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 22050, 22050, 22050, 22050, 22050, 8363, 15300, 8363 };
u32 japan_sample_rates[] = { 32680, 8363, 8363, 18000, 16250, 8363, 8363, 8363, 8363, 8363, 11025, 11025, 11025, 11025, 8363, 13100, 8363, 11025, 11025, 11025, 11025, 11025, 8363, 8363, 8363, 8363, 8363, 8363, 24600, 24600, 22050, 22050, 22050, 22050, 22050, 8363 };
u32 kalinka_sample_rates[] = { 8363, 8363, 8363, 8363, 8363, 8363, 8363, 8363, 13050, 26100, 26150, 8363, 8363, 8363, 8363, 8363, 8363, 10000, 8363, 22050, 22050, 22050, 22050, 22050, 22050, 8363 };

typedef struct {
  /* 0x0 */ char  *name;
  /* 0x4 */ char  *file;
  /* 0x8 */ u32   *sample_rates;
} DcmLutEntry; // 0xC bytes

DcmLutEntry dcm_lut[] = {
  { "Title", "dcm/5BAB26.bin", title_sample_rates },
  { "Morocco", "dcm/5E5C60.bin", morocco_sample_rates },
  { "Dvie", "dcm/60B9EA.bin", dvie_sample_rates },
  { "Polyasia", "dcm/61B1CC.bin", polyasia_sample_rates },
  { "Floppy", "dcm/62A10C.bin", floppy_sample_rates },
  { "Pyramid", "dcm/640206.bin", pyramid_sample_rates },
  { "Giali", "dcm/6543AC.bin", giali_sample_rates },
  { "Thread6", "dcm/680D76.bin", thread6_sample_rates },
  { "Haluci", "dcm/6AD41E.bin", haluci_sample_rates },
  { "Mayan", "dcm/6E1EAA.bin", mayan_sample_rates },
  { "Greek", "dcm/70F57A.bin", greek_sample_rates },
  { "Egypt", "dcm/72B89A.bin", egypt_sample_rates },
  { "Celtic", "dcm/73B2B0.bin", celtic_sample_rates },
  { "Africa", "dcm/76562E.bin", africa_sample_rates },
  { "Japan", "dcm/783E8E.bin", japan_sample_rates },
  { "Kalinka", "dcm/7A81C2.bin", kalinka_sample_rates },
